import type {ProvinceItem} from './types/main.js';

export const monthOptions = [
  { label: 'فروردین', value: '1' },
  { label: 'اردیبهشت', value: '2' },
  { label: 'خرداد', value: '3' },
  { label: 'تیر', value: '4' },
  { label: 'مرداد', value: '5' },
  { label: 'شهریور', value: '6' },
  { label: 'مهر', value: '7' },
  { label: 'آبان', value: '8' },
  { label: 'آذر', value: '9' },
  { label: 'دی', value: '10' },
  { label: 'بهمن', value: '11' },
  { label: 'اسفند', value: '12' }
];

export const dayOptions: string[] = Array.from({ length: 31 }, (_, i) => (i + 1).toString().padStart(2, '0'));

export const yearOptions: string[] = [];
for (let i = 1320; i <= 1390; i++) {
  yearOptions.push(i.toString());
}

export const provinceOptions: Record<string, ProvinceItem> = {
  '1': {
    "id": '1',
    "label": "تهران",
    "slug": "تهران",
    "cities": [
      {
        "id": '301',
        "label": "تهران",
        "slug": "تهران"
      },
      {
        "id": '290',
        "label": "ارجمند",
        "slug": "ارجمند"
      },
      {
        "id": '291',
        "label": "اسلامشهر",
        "slug": "اسلامشهر"
      },
      {
        "id": '292',
        "label": "اندیشه",
        "slug": "اندیشه"
      },
      {
        "id": '293',
        "label": "آبسرد",
        "slug": "آبسرد"
      },
      {
        "id": '294',
        "label": "آبعلی",
        "slug": "آبعلی"
      },
      {
        "id": '295',
        "label": "باغستان",
        "slug": "باغستان"
      },
      {
        "id": '296',
        "label": "باقرشهر",
        "slug": "باقرشهر"
      },
      {
        "id": '297',
        "label": "بومهن",
        "slug": "بومهن"
      },
      {
        "id": '298',
        "label": "پاکدشت",
        "slug": "پاکدشت"
      },
      {
        "id": '299',
        "label": "پردیس",
        "slug": "پردیس"
      },
      {
        "id": '300',
        "label": "پیشوا",
        "slug": "پیشوا"
      },
      {
        "id": '302',
        "label": "جوادآباد",
        "slug": "جوادآباد"
      },
      {
        "id": '303',
        "label": "چهاردانگه",
        "slug": "چهاردانگه"
      },
      {
        "id": '304',
        "label": "حسن آباد",
        "slug": "تهران-حسن-آباد"
      },
      {
        "id": '305',
        "label": "دماوند",
        "slug": "دماوند"
      },
      {
        "id": '306',
        "label": "دیزین",
        "slug": "دیزین"
      },
      {
        "id": '307',
        "label": "شهر ری",
        "slug": "شهر-ری"
      },
      {
        "id": '308',
        "label": "رباط کریم",
        "slug": "رباط-کریم"
      },
      {
        "id": '309',
        "label": "رودهن",
        "slug": "رودهن"
      },
      {
        "id": '310',
        "label": "شاهدشهر",
        "slug": "شاهدشهر"
      },
      {
        "id": '311',
        "label": "شریف آباد",
        "slug": "شریف-آباد"
      },
      {
        "id": '312',
        "label": "شمشک",
        "slug": "شمشک"
      },
      {
        "id": '313',
        "label": "شهریار",
        "slug": "شهریار"
      },
      {
        "id": '314',
        "label": "صالح آباد",
        "slug": "تهران-صالح-آباد"
      },
      {
        "id": '315',
        "label": "صباشهر",
        "slug": "صباشهر"
      },
      {
        "id": '316',
        "label": "صفادشت",
        "slug": "صفادشت"
      },
      {
        "id": '317',
        "label": "فردوسیه",
        "slug": "فردوسیه"
      },
      {
        "id": '318',
        "label": "فشم",
        "slug": "فشم"
      },
      {
        "id": '319',
        "label": "فیروزکوه",
        "slug": "فیروزکوه"
      },
      {
        "id": '320',
        "label": "قدس",
        "slug": "قدس"
      },
      {
        "id": '321',
        "label": "قرچک",
        "slug": "قرچک"
      },
      {
        "id": '322',
        "label": "کهریزک",
        "slug": "کهریزک"
      },
      {
        "id": '323',
        "label": "کیلان",
        "slug": "کیلان"
      },
      {
        "id": '324',
        "label": "گلستان",
        "slug": "شهر-گلستان"
      },
      {
        "id": '325',
        "label": "لواسان",
        "slug": "لواسان"
      },
      {
        "id": '326',
        "label": "ملارد",
        "slug": "ملارد"
      },
      {
        "id": '327',
        "label": "میگون",
        "slug": "میگون"
      },
      {
        "id": '328',
        "label": "نسیم شهر",
        "slug": "نسیم-شهر"
      },
      {
        "id": '329',
        "label": "نصیرآباد",
        "slug": "نصیرآباد"
      },
      {
        "id": '330',
        "label": "وحیدیه",
        "slug": "وحیدیه"
      },
      {
        "id": '331',
        "label": "ورامین",
        "slug": "ورامین"
      },
      {
        "id": '1116',
        "label": "پرند",
        "slug": "پرند"
      },
      {
        "id": '1153',
        "label": "قیامدشت",
        "slug": "قیامدشت"
      }
    ]
  },
  '2': {
    "id": '2',
    "label": "خراسان رضوی",
    "slug": "خراسان-رضوی",
    "cities": [
      {
        "id": '444',
        "label": "مشهد",
        "slug": "مشهد"
      },
      {
        "id": '383',
        "label": "احمدآباد صولت",
        "slug": "احمدآباد-صولت"
      },
      {
        "id": '384',
        "label": "انابد",
        "slug": "انابد"
      },
      {
        "id": '385',
        "label": "باجگیران",
        "slug": "باجگیران"
      },
      {
        "id": '386',
        "label": "باخرز",
        "slug": "باخرز"
      },
      {
        "id": '387',
        "label": "بار",
        "slug": "بار"
      },
      {
        "id": '388',
        "label": "بایگ",
        "slug": "بایگ"
      },
      {
        "id": '389',
        "label": "بجستان",
        "slug": "بجستان"
      },
      {
        "id": '390',
        "label": "بردسکن",
        "slug": "بردسکن"
      },
      {
        "id": '391',
        "label": "بیدخت",
        "slug": "بیدخت"
      },
      {
        "id": '392',
        "label": "تایباد",
        "slug": "تایباد"
      },
      {
        "id": '393',
        "label": "تربت جام",
        "slug": "تربت-جام"
      },
      {
        "id": '394',
        "label": "تربت حیدریه",
        "slug": "تربت-حیدریه"
      },
      {
        "id": '395',
        "label": "جغتای",
        "slug": "جغتای"
      },
      {
        "id": '396',
        "label": "جنگل",
        "slug": "جنگل"
      },
      {
        "id": '397',
        "label": "چاپشلو",
        "slug": "چاپشلو"
      },
      {
        "id": '398',
        "label": "چکنه",
        "slug": "چکنه"
      },
      {
        "id": '399',
        "label": "چناران",
        "slug": "چناران"
      },
      {
        "id": '400',
        "label": "خرو",
        "slug": "خرو"
      },
      {
        "id": '401',
        "label": "خلیل آباد",
        "slug": "خلیل-آباد"
      },
      {
        "id": '402',
        "label": "خواف",
        "slug": "خواف"
      },
      {
        "id": '403',
        "label": "داورزن",
        "slug": "داورزن"
      },
      {
        "id": '404',
        "label": "درگز",
        "slug": "درگز"
      },
      {
        "id": '405',
        "label": "در رود",
        "slug": "در-رود"
      },
      {
        "id": '406',
        "label": "دولت آباد",
        "slug": "خراسان-رضوی-دولت-آباد"
      },
      {
        "id": '407',
        "label": "رباط سنگ",
        "slug": "رباط-سنگ"
      },
      {
        "id": '408',
        "label": "رشتخوار",
        "slug": "رشتخوار"
      },
      {
        "id": '409',
        "label": "رضویه",
        "slug": "رضویه"
      },
      {
        "id": '410',
        "label": "روداب",
        "slug": "روداب"
      },
      {
        "id": '411',
        "label": "ریوش",
        "slug": "ریوش"
      },
      {
        "id": '412',
        "label": "سبزوار",
        "slug": "سبزوار"
      },
      {
        "id": '413',
        "label": "سرخس",
        "slug": "سرخس"
      },
      {
        "id": '414',
        "label": "سفیدسنگ",
        "slug": "سفیدسنگ"
      },
      {
        "id": '415',
        "label": "سلامی",
        "slug": "سلامی"
      },
      {
        "id": '416',
        "label": "سلطان آباد",
        "slug": "سلطان-آباد"
      },
      {
        "id": '417',
        "label": "سنگان",
        "slug": "سنگان"
      },
      {
        "id": '418',
        "label": "شادمهر",
        "slug": "شادمهر"
      },
      {
        "id": '419',
        "label": "شاندیز",
        "slug": "شاندیز"
      },
      {
        "id": '420',
        "label": "ششتمد",
        "slug": "ششتمد"
      },
      {
        "id": '421',
        "label": "شهرآباد",
        "slug": "شهرآباد"
      },
      {
        "id": '422',
        "label": "شهرزو",
        "slug": "شهرزو"
      },
      {
        "id": '423',
        "label": "صالح آباد",
        "slug": "خراسان-رضوی-صالح-آباد"
      },
      {
        "id": '424',
        "label": "طرقبه",
        "slug": "طرقبه"
      },
      {
        "id": '425',
        "label": "عشق آباد",
        "slug": "خراسان-رضوی-عشق-آباد"
      },
      {
        "id": '426',
        "label": "فرهادگرد",
        "slug": "فرهادگرد"
      },
      {
        "id": '427',
        "label": "فریمان",
        "slug": "فریمان"
      },
      {
        "id": '428',
        "label": "فیروزه",
        "slug": "فیروزه"
      },
      {
        "id": '429',
        "label": "فیض آباد",
        "slug": "فیض-آباد"
      },
      {
        "id": '430',
        "label": "قاسم آباد",
        "slug": "قاسم-آباد"
      },
      {
        "id": '431',
        "label": "قدمگاه",
        "slug": "قدمگاه"
      },
      {
        "id": '432',
        "label": "قلندرآباد",
        "slug": "قلندرآباد"
      },
      {
        "id": '433',
        "label": "قوچان",
        "slug": "قوچان"
      },
      {
        "id": '434',
        "label": "کاخک",
        "slug": "کاخک"
      },
      {
        "id": '435',
        "label": "کاریز",
        "slug": "کاریز"
      },
      {
        "id": '436',
        "label": "کاشمر",
        "slug": "کاشمر"
      },
      {
        "id": '437',
        "label": "کدکن",
        "slug": "کدکن"
      },
      {
        "id": '438',
        "label": "کلات",
        "slug": "کلات"
      },
      {
        "id": '439',
        "label": "کندر",
        "slug": "کندر"
      },
      {
        "id": '440',
        "label": "گلمکان",
        "slug": "گلمکان"
      },
      {
        "id": '441',
        "label": "گناباد",
        "slug": "گناباد"
      },
      {
        "id": '442',
        "label": "لطف آباد",
        "slug": "لطف-آباد"
      },
      {
        "id": '443',
        "label": "مزدآوند",
        "slug": "مزدآوند"
      },
      {
        "id": '445',
        "label": "ملک آباد",
        "slug": "ملک-آباد"
      },
      {
        "id": '446',
        "label": "نشتیفان",
        "slug": "نشتیفان"
      },
      {
        "id": '447',
        "label": "نصرآباد",
        "slug": "خراسان-رضوی-نصرآباد"
      },
      {
        "id": '448',
        "label": "نقاب",
        "slug": "نقاب"
      },
      {
        "id": '449',
        "label": "نوخندان",
        "slug": "نوخندان"
      },
      {
        "id": '450',
        "label": "نیشابور",
        "slug": "نیشابور"
      },
      {
        "id": '451',
        "label": "نیل شهر",
        "slug": "نیل-شهر"
      },
      {
        "id": '452',
        "label": "همت آباد",
        "slug": "همت-آباد"
      },
      {
        "id": '453',
        "label": "یونسی",
        "slug": "یونسی"
      },
      {
        "id": '1150',
        "label": "گلبهار",
        "slug": ""
      },
      {
        "id": '1155',
        "label": "بینالود",
        "slug": "بینالود"
      }
    ]
  },
  '8': {
    "id": '8',
    "label": "آذربایجان شرقی",
    "slug": "آذربایجان-شرقی",
    "cities": [
      {
        "id": '10',
        "label": "بناب",
        "slug": "بناب"
      },
      {
        "id": '11',
        "label": "بناب جدید",
        "slug": "بناب-جدید"
      },
      {
        "id": '12',
        "label": "تبریز",
        "slug": "تبریز"
      },
      {
        "id": '17',
        "label": "جلفا",
        "slug": "جلفا"
      },
      {
        "id": '30',
        "label": "سهند",
        "slug": "سهند"
      },
      {
        "id": '46',
        "label": "مراغه",
        "slug": "مراغه"
      },
      {
        "id": '47',
        "label": "مرند",
        "slug": "مرند"
      },
      {
        "id": '48',
        "label": "ملکان",
        "slug": "ملکان"
      },
      {
        "id": '49',
        "label": "ملک کیان",
        "slug": "ملک-کیان"
      },
      {
        "id": '50',
        "label": "ممقان",
        "slug": "ممقان"
      },
      {
        "id": '51',
        "label": "مهربان",
        "slug": "مهربان"
      },
      {
        "id": '52',
        "label": "میانه",
        "slug": "میانه"
      },
      {
        "id": '57',
        "label": "هشترود",
        "slug": "هشترود"
      },
      {
        "id": '58',
        "label": "هوراند",
        "slug": "هوراند"
      },
      {
        "id": '59',
        "label": "وایقان",
        "slug": "وایقان"
      },
      {
        "id": '60',
        "label": "ورزقان",
        "slug": "ورزقان"
      },
      {
        "id": '61',
        "label": "یامچی",
        "slug": "یامچی"
      }
    ]
  },
  '11': {
    "id": '11',
    "label": "آذربایجان غربی",
    "slug": "آذربایجان-غربی",
    "cities": [
      {
        "id": '62',
        "label": "ارومیه",
        "slug": "ارومیه"
      },
      {
        "id": '63',
        "label": "اشنویه",
        "slug": "اشنویه"
      },
      {
        "id": '68',
        "label": "بوکان",
        "slug": "بوکان"
      },
      {
        "id": '69',
        "label": "پلدشت",
        "slug": "پلدشت"
      },
      {
        "id": '70',
        "label": "پیرانشهر",
        "slug": "پیرانشهر"
      },
      {
        "id": '74',
        "label": "خوی",
        "slug": "خوی"
      },
      {
        "id": '77',
        "label": "سردشت",
        "slug": "آذربایجان-غربی-سردشت"
      },
      {
        "id": '79',
        "label": "سلماس",
        "slug": "سلماس"
      },
      {
        "id": '91',
        "label": "ماکو",
        "slug": "ماکو"
      },
      {
        "id": '94',
        "label": "مهاباد",
        "slug": "آذربایجان-غربی-مهاباد"
      },
      {
        "id": '95',
        "label": "میاندوآب",
        "slug": "میاندوآب"
      },
      {
        "id": '98',
        "label": "نقده",
        "slug": "نقده"
      },
      {
        "id": '99',
        "label": "نوشین",
        "slug": "نوشین"
      }
    ]
  },
  '3': {
    "id": '3',
    "label": "اردبیل",
    "slug": "اردبیل",
    "cities": [
      {
        "id": '100',
        "label": "اردبیل",
        "slug": "اردبیل"
      },
      {
        "id": '101',
        "label": "اصلاندوز",
        "slug": "اصلاندوز"
      },
      {
        "id": '110',
        "label": "سرعین",
        "slug": "سرعین"
      },
      {
        "id": '118',
        "label": "مشگین شهر",
        "slug": "مشگین-شهر"
      }
    ]
  },
  '4': {
    "id": '4',
    "label": "اصفهان",
    "slug": "اصفهان",
    "cities": [
      {
        "id": '127',
        "label": "اصفهان",
        "slug": "اصفهان"
      },
      {
        "id": '131',
        "label": "آران وبیدگل",
        "slug": "آران-وبیدگل"
      },
      {
        "id": '139',
        "label": "بوئین و میاندشت",
        "slug": "بوئین-میاندشت"
      },
      {
        "id": '153',
        "label": "خمینی شهر",
        "slug": "خمینی-شهر"
      },
      {
        "id": '154',
        "label": "خوانسار",
        "slug": "خوانسار"
      },
      {
        "id": '175',
        "label": "سمیرم",
        "slug": "سمیرم"
      },
      {
        "id": '176',
        "label": "شاهین شهر",
        "slug": "شاهین-شهر"
      },
      {
        "id": '177',
        "label": "شهرضا",
        "slug": "شهرضا"
      },
      {
        "id": '184',
        "label": "فولادشهر",
        "slug": "فولادشهر"
      },
      {
        "id": '185',
        "label": "قمصر",
        "slug": "قمصر"
      },
      {
        "id": '188',
        "label": "کاشان",
        "slug": "کاشان"
      },
      {
        "id": '198',
        "label": "گلپایگان",
        "slug": "گلپایگان"
      },
      {
        "id": '203',
        "label": "مبارکه",
        "slug": "مبارکه"
      },
      {
        "id": '210',
        "label": "نائین",
        "slug": "نائین"
      },
      {
        "id": '211',
        "label": "نجف آباد",
        "slug": "نجف-آباد"
      },
      {
        "id": '213',
        "label": "نطنز",
        "slug": "نطنز"
      }
    ]
  },
  '5': {
    "id": '5',
    "label": "البرز",
    "slug": "البرز",
    "cities": [
      {
        "id": '223',
        "label": "اشتهارد",
        "slug": "اشتهارد"
      },
      {
        "id": '227',
        "label": "شهر جدید هشتگرد",
        "slug": "شهر-جدید-هشتگرد"
      },
      {
        "id": '229',
        "label": "کرج",
        "slug": "کرج"
      },
      {
        "id": '237',
        "label": "هشتگرد",
        "slug": "هشتگرد"
      },
      {
        "id": '1117',
        "label": "فردیس",
        "slug": "فردیس"
      },
      {
        "id": '1118',
        "label": "مارلیک",
        "slug": "مارلیک"
      },
      {
        "id": '1135',
        "label": "کردان",
        "slug": "کردان"
      },
      {
        "id": '1137',
        "label": "ساوجبلاغ",
        "slug": "ساوجبلاغ"
      },
      {
        "id": '1138',
        "label": "تهران دشت",
        "slug": "تهران-دشت"
      }
    ]
  },
  '6': {
    "id": '6',
    "label": "ایلام",
    "slug": "ایلام",
    "cities": [
      {
        "id": '239',
        "label": "ایلام",
        "slug": "ایلام"
      },
      {
        "id": '249',
        "label": "دهلران",
        "slug": "دهلران"
      }
    ]
  },
  '7': {
    "id": '7',
    "label": "بوشهر",
    "slug": "بوشهر",
    "cities": [
      {
        "id": '264',
        "label": "برازجان",
        "slug": "برازجان"
      },
      {
        "id": '266',
        "label": "بندردیر",
        "slug": "بندردیر"
      },
      {
        "id": '267',
        "label": "بندردیلم",
        "slug": "بندردیلم"
      },
      {
        "id": '268',
        "label": "بندرریگ",
        "slug": "بندرریگ"
      },
      {
        "id": '269',
        "label": "بندرکنگان",
        "slug": "بندرکنگان"
      },
      {
        "id": '270',
        "label": "بندرگناوه",
        "slug": "بندرگناوه"
      },
      {
        "id": '272',
        "label": "بوشهر",
        "slug": "بوشهر"
      },
      {
        "id": '273',
        "label": "تنگ ارم",
        "slug": "تنگ-ارم"
      },
      {
        "id": '276',
        "label": "خارک",
        "slug": "خارک"
      },
      {
        "id": '285',
        "label": "عسلویه",
        "slug": "عسلویه"
      }
    ]
  },
  '9': {
    "id": '9',
    "label": "چهارمحال و بختیاری",
    "slug": "چهارمحال-بختیاری",
    "cities": [
      {
        "id": '332',
        "label": "اردل",
        "slug": "اردل"
      },
      {
        "id": '345',
        "label": "شهرکرد",
        "slug": "شهرکرد"
      },
      {
        "id": '353',
        "label": "لردگان",
        "slug": "لردگان"
      }
    ]
  },
  '10': {
    "id": '10',
    "label": "خراسان جنوبی",
    "slug": "خراسان-جنوبی",
    "cities": [
      {
        "id": '365',
        "label": "بشرویه",
        "slug": "بشرویه"
      },
      {
        "id": '366',
        "label": "بیرجند",
        "slug": "بیرجند"
      },
      {
        "id": '369',
        "label": "خوسف",
        "slug": "خوسف"
      },
      {
        "id": '375',
        "label": "طبس ",
        "slug": "خراسان-جنوبی-طبس-"
      },
      {
        "id": '376',
        "label": "فردوس",
        "slug": "فردوس"
      },
      {
        "id": '377',
        "label": "قاین",
        "slug": "قاین"
      },
      {
        "id": '381',
        "label": "نهبندان",
        "slug": "نهبندان"
      }
    ]
  },
  '12': {
    "id": '12',
    "label": "خراسان شمالی",
    "slug": "خراسان-شمالی",
    "cities": [
      {
        "id": '454',
        "label": "اسفراین",
        "slug": "اسفراین"
      },
      {
        "id": '457',
        "label": "بجنورد",
        "slug": "بجنورد"
      },
      {
        "id": '466',
        "label": "شیروان",
        "slug": "شیروان"
      },
      {
        "id": '468',
        "label": "فاروج",
        "slug": "فاروج"
      }
    ]
  },
  '13': {
    "id": '13',
    "label": "خوزستان",
    "slug": "خوزستان",
    "cities": [
      {
        "id": '472',
        "label": "اروندکنار",
        "slug": "اروندکنار"
      },
      {
        "id": '474',
        "label": "امیدیه",
        "slug": "امیدیه"
      },
      {
        "id": '475',
        "label": "اندیمشک",
        "slug": "اندیمشک"
      },
      {
        "id": '476',
        "label": "اهواز",
        "slug": "اهواز"
      },
      {
        "id": '477',
        "label": "ایذه",
        "slug": "ایذه"
      },
      {
        "id": '478',
        "label": "آبادان",
        "slug": "آبادان"
      },
      {
        "id": '482',
        "label": "بندرامام خمینی",
        "slug": "بندرامام-خمینی"
      },
      {
        "id": '483',
        "label": "بندرماهشهر",
        "slug": "بندرماهشهر"
      },
      {
        "id": '484',
        "label": "بهبهان",
        "slug": "بهبهان"
      },
      {
        "id": '492',
        "label": "حمیدیه",
        "slug": "حمیدیه"
      },
      {
        "id": '493',
        "label": "خرمشهر",
        "slug": "خرمشهر"
      },
      {
        "id": '496',
        "label": "دزفول",
        "slug": "دزفول"
      },
      {
        "id": '499',
        "label": "رامهرمز",
        "slug": "رامهرمز"
      },
      {
        "id": '504',
        "label": "سوسنگرد",
        "slug": "سوسنگرد"
      },
      {
        "id": '508',
        "label": "شوش",
        "slug": "شوش"
      },
      {
        "id": '509',
        "label": "شوشتر",
        "slug": "شوشتر"
      },
      {
        "id": '518',
        "label": "مسجدسلیمان",
        "slug": "مسجدسلیمان"
      },
      {
        "id": '525',
        "label": "هویزه",
        "slug": "هویزه"
      }
    ]
  },
  '14': {
    "id": '14',
    "label": "زنجان",
    "slug": "زنجان",
    "cities": [
      {
        "id": '527',
        "label": "ابهر",
        "slug": "ابهر"
      },
      {
        "id": '536',
        "label": "زنجان",
        "slug": "زنجان"
      }
    ]
  },
  '15': {
    "id": '15',
    "label": "سمنان",
    "slug": "سمنان",
    "cities": [
      {
        "id": '550',
        "label": "دامغان",
        "slug": "دامغان"
      },
      {
        "id": '554',
        "label": "سمنان",
        "slug": "سمنان"
      },
      {
        "id": '555',
        "label": "شاهرود",
        "slug": "شاهرود"
      },
      {
        "id": '556',
        "label": "شهمیرزاد",
        "slug": "شهمیرزاد"
      },
      {
        "id": '558',
        "label": "گرمسار",
        "slug": "گرمسار"
      }
    ]
  },
  '16': {
    "id": '16',
    "label": "سیستان و بلوچستان",
    "slug": "سیستان-بلوچستان",
    "cities": [
      {
        "id": '564',
        "label": "ایرانشهر",
        "slug": "ایرانشهر"
      },
      {
        "id": '571',
        "label": "چابهار",
        "slug": "چابهار"
      },
      {
        "id": '572',
        "label": "خاش",
        "slug": "خاش"
      },
      {
        "id": '574',
        "label": "راسک",
        "slug": "راسک"
      },
      {
        "id": '575',
        "label": "زابل",
        "slug": "زابل"
      },
      {
        "id": '577',
        "label": "زاهدان",
        "slug": "زاهدان"
      },
      {
        "id": '579',
        "label": "سراوان",
        "slug": "سراوان"
      },
      {
        "id": '586',
        "label": "کنارک",
        "slug": "کنارک"
      }
    ]
  },
  '17': {
    "id": '17',
    "label": "فارس",
    "slug": "فارس",
    "cities": [
      {
        "id": '598',
        "label": "اردکان",
        "slug": "فارس-اردکان"
      },
      {
        "id": '647',
        "label": "شیراز",
        "slug": "شیراز"
      },
      {
        "id": '661',
        "label": "کازرون",
        "slug": "کازرون"
      },
      {
        "id": '673',
        "label": "مرودشت",
        "slug": "مرودشت"
      }
    ]
  },
  '18': {
    "id": '18',
    "label": "قزوین",
    "slug": "قزوین",
    "cities": [
      {
        "id": '691',
        "label": "بوئین زهرا",
        "slug": "بوئین-زهرا"
      },
      {
        "id": '693',
        "label": "تاکستان",
        "slug": "تاکستان"
      },
      {
        "id": '703',
        "label": "قزوین",
        "slug": "قزوین"
      }
    ]
  },
  '19': {
    "id": '19',
    "label": "قم",
    "slug": "قم",
    "cities": [
      {
        "id": '710',
        "label": "دستجرد",
        "slug": "دستجرد"
      },
      {
        "id": '712',
        "label": "قم",
        "slug": "قم"
      }
    ]
  },
  '20': {
    "id": '20',
    "label": "کردستان",
    "slug": "کردستان",
    "cities": [
      {
        "id": '717',
        "label": "بانه",
        "slug": "بانه"
      },
      {
        "id": '720',
        "label": "بیجار",
        "slug": "بیجار"
      },
      {
        "id": '724',
        "label": "دهگلان",
        "slug": "دهگلان"
      },
      {
        "id": '725',
        "label": "دیواندره",
        "slug": "دیواندره"
      },
      {
        "id": '729',
        "label": "سقز",
        "slug": "سقز"
      },
      {
        "id": '730',
        "label": "سنندج",
        "slug": "سنندج"
      },
      {
        "id": '737',
        "label": "مریوان",
        "slug": "مریوان"
      }
    ]
  },
  '21': {
    "id": '21',
    "label": "کرمان",
    "slug": "کرمان",
    "cities": [
      {
        "id": '750',
        "label": "بم",
        "slug": "بم"
      },
      {
        "id": '756',
        "label": "جیرفت",
        "slug": "جیرفت"
      },
      {
        "id": '766',
        "label": "رفسنجان",
        "slug": "رفسنجان"
      },
      {
        "id": '767',
        "label": "رودبار",
        "slug": "کرمان-رودبار"
      },
      {
        "id": '772',
        "label": "سیرجان",
        "slug": "سیرجان"
      },
      {
        "id": '781',
        "label": "کرمان",
        "slug": "کرمان"
      },
      {
        "id": '793',
        "label": "مس سرچشمه",
        "slug": "مس-سرچشمه"
      }
    ]
  },
  '22': {
    "id": '22',
    "label": "کرمانشاه",
    "slug": "کرمانشاه",
    "cities": [
      {
        "id": '806',
        "label": "پاوه",
        "slug": "پاوه"
      },
      {
        "id": '808',
        "label": "جوان رود",
        "slug": "جوان-رود"
      },
      {
        "id": '812',
        "label": "سرپل ذهاب",
        "slug": "سرپل-ذهاب"
      },
      {
        "id": '819',
        "label": "قصرشیرین",
        "slug": "قصرشیرین"
      },
      {
        "id": '820',
        "label": "کرمانشاه",
        "slug": "کرمانشاه"
      }
    ]
  },
  '23': {
    "id": '23',
    "label": "کهگیلویه و بویراحمد",
    "slug": "کهگیلویه-بویراحمد",
    "cities": [
      {
        "id": '846',
        "label": "یاسوج",
        "slug": "یاسوج"
      }
    ]
  },
  '24': {
    "id": '24',
    "label": "گلستان",
    "slug": "گلستان",
    "cities": [
      {
        "id": '849',
        "label": "آزادشهر",
        "slug": "آزادشهر"
      },
      {
        "id": '850',
        "label": "آق قلا",
        "slug": "آق-قلا"
      },
      {
        "id": '851',
        "label": "بندرترکمن",
        "slug": "بندرترکمن"
      },
      {
        "id": '852',
        "label": "بندرگز",
        "slug": "بندرگز"
      },
      {
        "id": '859',
        "label": "علی آباد کتول",
        "slug": "علی-آباد-کتول"
      },
      {
        "id": '860',
        "label": "فاضل آباد",
        "slug": "فاضل-آباد"
      },
      {
        "id": '863',
        "label": "گالیکش",
        "slug": "گالیکش"
      },
      {
        "id": '864',
        "label": "گرگان",
        "slug": "گرگان"
      },
      {
        "id": '866',
        "label": "گنبدکاووس",
        "slug": "گنبدکاووس"
      }
    ]
  },
  '25': {
    "id": '25',
    "label": "لرستان",
    "slug": "لرستان",
    "cities": [
      {
        "id": '875',
        "label": "الیگودرز",
        "slug": "الیگودرز"
      },
      {
        "id": '876',
        "label": "بروجرد",
        "slug": "بروجرد"
      },
      {
        "id": '877',
        "label": "پلدختر",
        "slug": "پلدختر"
      },
      {
        "id": '881',
        "label": "خرم آباد",
        "slug": "لرستان-خرم-آباد"
      },
      {
        "id": '883',
        "label": "دورود",
        "slug": "دورود"
      },
      {
        "id": '889',
        "label": "کوهدشت",
        "slug": "کوهدشت"
      }
    ]
  },
  '26': {
    "id": '26',
    "label": "گیلان",
    "slug": "گیلان",
    "cities": [
      {
        "id": '899',
        "label": "آستارا",
        "slug": "آستارا"
      },
      {
        "id": '900',
        "label": "آستانه اشرفیه",
        "slug": "آستانه-اشرفیه"
      },
      {
        "id": '903',
        "label": "بندرانزلی",
        "slug": "بندرانزلی"
      },
      {
        "id": '907',
        "label": "تالش",
        "slug": "تالش"
      },
      {
        "id": '908',
        "label": "توتکابن",
        "slug": "توتکابن"
      },
      {
        "id": '920',
        "label": "رشت",
        "slug": "رشت"
      },
      {
        "id": '929',
        "label": "صومعه سرا",
        "slug": "صومعه-سرا"
      },
      {
        "id": '930',
        "label": "فومن",
        "slug": "فومن"
      },
      {
        "id": '936',
        "label": "لاهیجان",
        "slug": "لاهیجان"
      },
      {
        "id": '938',
        "label": "لنگرود",
        "slug": "لنگرود"
      },
      {
        "id": '943',
        "label": "ماسال",
        "slug": "ماسال"
      },
      {
        "id": '944',
        "label": "ماسوله",
        "slug": "ماسوله"
      },
      {
        "id": '946',
        "label": "منجیل",
        "slug": "منجیل"
      },
      {
        "id": '1121',
        "label": "زیباکنار",
        "slug": "زیباکنار"
      }
    ]
  },
  '27': {
    "id": '27',
    "label": "مازندران",
    "slug": "مازندران",
    "cities": [
      {
        "id": '951',
        "label": "آمل",
        "slug": "آمل"
      },
      {
        "id": '952',
        "label": "بابل",
        "slug": "بابل"
      },
      {
        "id": '953',
        "label": "بابلسر",
        "slug": "بابلسر"
      },
      {
        "id": '958',
        "label": "تنکابن",
        "slug": "تنکابن"
      },
      {
        "id": '959',
        "label": "جویبار",
        "slug": "جویبار"
      },
      {
        "id": '960',
        "label": "چالوس",
        "slug": "چالوس"
      },
      {
        "id": '966',
        "label": "رامسر",
        "slug": "رامسر"
      },
      {
        "id": '972',
        "label": "ساری",
        "slug": "ساری"
      },
      {
        "id": '977',
        "label": "شیرود",
        "slug": "شیرود"
      },
      {
        "id": '979',
        "label": "فریدونکنار",
        "slug": "فریدونکنار"
      },
      {
        "id": '981',
        "label": "قائم شهر",
        "slug": "قائم-شهر"
      },
      {
        "id": '984',
        "label": "کلاردشت",
        "slug": "کلاردشت"
      },
      {
        "id": '992',
        "label": "محمودآباد",
        "slug": "مازندران-محمودآباد"
      },
      {
        "id": '996',
        "label": "نکا",
        "slug": "نکا"
      },
      {
        "id": '997',
        "label": "نور",
        "slug": "نور"
      },
      {
        "id": '998',
        "label": "نوشهر",
        "slug": "نوشهر"
      }
    ]
  },
  '28': {
    "id": '28',
    "label": "مرکزی",
    "slug": "مرکزی",
    "cities": [
      {
        "id": '999',
        "label": "اراک",
        "slug": "اراک"
      },
      {
        "id": '1000',
        "label": "آستانه",
        "slug": "آستانه"
      },
      {
        "id": '1007',
        "label": "خمین",
        "slug": "خمین"
      },
      {
        "id": '1010',
        "label": "دلیجان",
        "slug": "دلیجان"
      },
      {
        "id": '1014',
        "label": "ساوه",
        "slug": "ساوه"
      },
      {
        "id": '1016',
        "label": "شازند",
        "slug": "شازند"
      }
    ]
  },
  '29': {
    "id": '29',
    "label": "هرمزگان",
    "slug": "هرمزگان",
    "cities": [
      {
        "id": '1030',
        "label": "ابوموسی",
        "slug": "ابوموسی"
      },
      {
        "id": '1032',
        "label": "بندرجاسک",
        "slug": "بندرجاسک"
      },
      {
        "id": '1033',
        "label": "بندرچارک",
        "slug": "بندرچارک"
      },
      {
        "id": '1034',
        "label": "بندرخمیر",
        "slug": "بندرخمیر"
      },
      {
        "id": '1035',
        "label": "بندرعباس",
        "slug": "بندرعباس"
      },
      {
        "id": '1036',
        "label": "بندرلنگه",
        "slug": "بندرلنگه"
      },
      {
        "id": '1042',
        "label": "درگهان",
        "slug": "درگهان"
      },
      {
        "id": '1052',
        "label": "قشم",
        "slug": "قشم"
      },
      {
        "id": '1056',
        "label": "کیش",
        "slug": "کیش"
      },
      {
        "id": '1059',
        "label": "هرمز",
        "slug": "هرمز"
      }
    ]
  },
  '30': {
    "id": '30',
    "label": "همدان",
    "slug": "همدان",
    "cities": [
      {
        "id": '1065',
        "label": "تویسرکان",
        "slug": "تویسرکان"
      },
      {
        "id": '1085',
        "label": "ملایر",
        "slug": "ملایر"
      },
      {
        "id": '1086',
        "label": "نهاوند",
        "slug": "نهاوند"
      },
      {
        "id": '1087',
        "label": "همدان",
        "slug": "همدان"
      }
    ]
  },
  '31': {
    "id": '31',
    "label": "یزد",
    "slug": "یزد",
    "cities": [
      {
        "id": '1090',
        "label": "اردکان",
        "slug": "یزد-اردکان"
      },
      {
        "id": '1101',
        "label": "طبس",
        "slug": "یزد-طبس"
      },
      {
        "id": '1107',
        "label": "میبد",
        "slug": "میبد"
      },
      {
        "id": '1111',
        "label": "یزد",
        "slug": "یزد"
      },
      {
        "id": '1160',
        "label": "رضوانشهر",
        "slug": "رضوانشهر"
      }
    ]
  }
};
